{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.17.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same",
              "input_shape": [256, 256, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 64,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 128,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "size": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 64,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "size": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 3,
              "kernel_size": [3, 3],
              "activation": "sigmoid",
              "padding": "same"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"},
        {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"},
        {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"},
        {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"},
        {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"},
        {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"},
        {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"},
        {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 3], "dtype": "float32"},
        {"name": "conv2d_5/bias", "shape": [3], "dtype": "float32"}
      ]
    }
  ]
} 